CSI API ETABS v1
cFrameObj.SetColumnSpliceOverwrite Method
 Sets the frame object column splice overwrite assignment.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetColumnSpliceOverwrite(
	string Name,
	int SpliceOption,
	double Height,
	eItemType ItemType = eItemType.Objects
)
Function SetColumnSpliceOverwrite (
	Name As String,
	SpliceOption As Integer,
	Height As Double,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim SpliceOption As Integer
Dim Height As Double
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetColumnSpliceOverwrite(Name,
	SpliceOption, Height, ItemType)
int SetColumnSpliceOverwrite(
	String^ Name,
	int SpliceOption,
	double Height,
	eItemType ItemType = eItemType::Objects
)
abstract SetColumnSpliceOverwrite :
        Name : string *
        SpliceOption : int *
        Height : float *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object.
SpliceOption
Type: System.Int32
 This is a numeric value from 1 to 3 that specifies the option used for defining the splice overwrite.
from story data (default)
no splice
splice at height above story at bottom of the column object
Height
Type: System.Double
 If the SpliceOption=3, this specifies the height of the splice above the story at the bottom of the column object.
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
 Returns zero if the column splice overwrite assignment is successful, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign column splice overwrite
   ret = SapModel.FrameObj.SetColumnSpliceOverwrite("15", 2, 0)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace